source/2_Lesson.org
#+STARTUP:indent
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/styles.css"/>
#+HTML_HEAD_EXTRA: <link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
#+HTML_HEAD_EXTRA: <script src="http://ajax.googleapis.com/ajax/libs/jquery/1.9.1/jquery.min.js" type="text/javascript"></script>
#+HTML_HEAD_EXTRA: <script src="js/navbar.js" type="text/javascript"></script>
#+OPTIONS: f:nil author:nil num:nil creator:nil timestamp:nil toc:nil html-style:nil

#+TITLE: 555 Piano 
#+AUTHOR: Marc Scott / Paul Dougall

#+BEGIN_HTML
  <div class="github-fork-ribbon-wrapper left">
    <div class="github-fork-ribbon">
      <a href="https://github.com/stpd11/8-CS-ESafety2">Fork me on GitHub</a>
    </div>
  </div>
<div id="stickyribbon">
    <ul>
      <li><a href="1_Lesson.html">Week1</a></li>
      <li><a href="2_Lesson.html">Week2</a></li>
      <li><a href="3_Lesson.html">Week3</a></li>
      <li><a href="4_Lesson.html">Week4</a></li>
      <li><a href="5_Lesson.html">Week5</a></li>
    </ul>
  </div>
#+END_HTML
* COMMENT Use as a template
:PROPERTIES:
:HTML_CONTAINER_CLASS: activity
:END:
** Learn It
:PROPERTIES:
:HTML_CONTAINER_CLASS: learn
:END:

** Research It
:PROPERTIES:
:HTML_CONTAINER_CLASS: research
:END:

** Design It
:PROPERTIES:
:HTML_CONTAINER_CLASS: design
:END:

** Build It
:PROPERTIES:
:HTML_CONTAINER_CLASS: build
:END:

** Test It
:PROPERTIES:
:HTML_CONTAINER_CLASS: test
:END:

** Run It
:PROPERTIES:
:HTML_CONTAINER_CLASS: run
:END:

** Document It
:PROPERTIES:
:HTML_CONTAINER_CLASS: document
:END:

** Code It
:PROPERTIES:
:HTML_CONTAINER_CLASS: code
:END:

** Program It
:PROPERTIES:
:HTML_CONTAINER_CLASS: program
:END:

** Try It
:PROPERTIES:
:HTML_CONTAINER_CLASS: try
:END:

** Badge It
:PROPERTIES:
:HTML_CONTAINER_CLASS: badge
:END:

** Save It
:PROPERTIES:
:HTML_CONTAINER_CLASS: save
:END:

* Sounds good to me
:PROPERTIES:
:HTML_CONTAINER_CLASS: activity
:END:
In this project you'll be creating an electronic piano or other instrument that is going to make *beautiful* music.
** Research It
:PROPERTIES:
:HTML_CONTAINER_CLASS: research
:END:
- The 555 timer will produce a pulse from the output to the speaker. The frequency of the pulse depends on the resistance of the circuit.
- Watch this video on what makes a low and high pitched sound.
#+BEGIN_HTML
<iframe width="560" height="315" src="https://www.youtube.com/embed/jveKIYyafaQ" frameborder="0" allowfullscreen></iframe>
#+END_HTML
** Badge It- Silver
:PROPERTIES:
:HTML_CONTAINER_CLASS: badge
:END:
- Conduct some research on sound and what makes a note have a high or low pitch.
- Upload your findings to achieve the badge.
* Resistance is not futile
:PROPERTIES:
:HTML_CONTAINER_CLASS: activity
:END:
- Watch this video *from 4 minutes in* and explain how a 555 timer can be made to make music.
 #+BEGIN_HTML
<iframe width="560" height="315" src="https://www.youtube.com/embed/rTmlR8B-u5c?t=4m34s" frameborder="0" allowfullscreen></iframe>
#+END_HTML
** Badge It - Gold
:PROPERTIES:
:HTML_CONTAINER_CLASS: badge
:END:
- Upload you notes from the video on using a 555 to make music
* KlassWerk
:PROPERTIES:
:HTML_CONTAINER_CLASS: activity
:END:
** Research It
:PROPERTIES:
:HTML_CONTAINER_CLASS: research
:END:
Research and collate your findings into a written report or presentation on a fully electronic music instrument such as:

- Moog modular synthesiser
- Theremin
- Stylophone

- Here is a nice [[http://makezine.com/2015/08/26/six-electronic-instruments-power-eardrums/][site]] which has both old and new electronic instruments.
- And one we could [[http://www.instructables.com/id/Light-Theremin/?ALLSTEPS][build]] as an extension task.
** Badge It - Platinum
:PROPERTIES:
:HTML_CONTAINER_CLASS: badge
:END:
For your chosen instrument explain:

- How does it work?
- How do you play it?
- Can you find an image?
- Can you find a sound/video file?

- Finally upload your work for the badge.
