pages/2_Lesson.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>555 Piano</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="css/styles.css"/>
<link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">555 Piano</h1>
  <div class="github-fork-ribbon-wrapper left">
    <div class="github-fork-ribbon">
      <a href="https://github.com/stpd11/8-CS-ESafety2">Fork me on GitHub</a>
    </div>
  </div>
<div id="stickyribbon">
    <ul>
      <li><a href="1_Lesson.html">Week1</a></li>
      <li><a href="2_Lesson.html">Week2</a></li>
      <li><a href="3_Lesson.html">Week3</a></li>
      <li><a href="4_Lesson.html">Week4</a></li>
      <li><a href="5_Lesson.html">Week5</a></li>
    </ul>
  </div>
<div id="outline-container-sec-1" class="outline-2 activity">
<h2 id="sec-1">Sounds good to me</h2>
<div class="outline-text-2" id="text-1">
<p>
In this project you'll be creating an electronic piano or other instrument that is going to make <b>beautiful</b> music.
</p>
</div>
<div id="outline-container-sec-1-1" class="outline-3 research">
<h3 id="sec-1-1">Research It</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>The 555 timer will produce a pulse from the output to the speaker. The frequency of the pulse depends on the resistance of the circuit.
</li>
<li>Watch this video on what makes a low and high pitched sound.
</li>
</ul>
<iframe width="560" height="315" src="https://www.youtube.com/embed/jveKIYyafaQ" frameborder="0" allowfullscreen></iframe>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3 badge">
<h3 id="sec-1-2">Badge It- Silver</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Conduct some research on sound and what makes a note have a high or low pitch.
</li>
<li>Upload your findings to achieve the badge.
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2 activity">
<h2 id="sec-2">Resistance is not futile</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Watch this video <b>from 4 minutes in</b> and explain how a 555 timer can be made to make music.
<iframe width="560" height="315" src="https://www.youtube.com/embed/rTmlR8B-u5c?t=4m34s" frameborder="0" allowfullscreen></iframe>
</li>
</ul>
</div>
<div id="outline-container-sec-2-1" class="outline-3 badge">
<h3 id="sec-2-1">Badge It - Gold</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Upload you notes from the video on using a 555 to make music
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2 activity">
<h2 id="sec-3">KlassWerk</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-sec-3-1" class="outline-3 research">
<h3 id="sec-3-1">Research It</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Research and collate your findings into a written report or presentation on a fully electronic music instrument such as:
</p>

<ul class="org-ul">
<li>Moog modular synthesiser
</li>
<li>Theremin
</li>
<li>Stylophone
</li>

<li>Here is a nice <a href="http://makezine.com/2015/08/26/six-electronic-instruments-power-eardrums/">site</a> which has both old and new electronic instruments.
</li>
<li>And one we could <a href="http://www.instructables.com/id/Light-Theremin/?ALLSTEPS">build</a> as an extension task.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3 badge">
<h3 id="sec-3-2">Badge It - Platinum</h3>
<div class="outline-text-3" id="text-3-2">
<p>
For your chosen instrument explain:
</p>

<ul class="org-ul">
<li>How does it work?
</li>
<li>How do you play it?
</li>
<li>Can you find an image?
</li>
<li>Can you find a sound/video file?
</li>

<li>Finally upload your work for the badge.
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
